app/Models/RolemenusModel.php

    function datarolefilter($id,  $key)
    {
        $filterrole = $this->db->table('rolemenus');
        $filterrole->select('submenus.submenu_link');
        $filterrole->join('roles', 'roles.role_id = rolemenus.role_id');
        $filterrole->join('submenus', 'submenus.submenu_id = rolemenus.submenu_id');
        if($id <> null){
            $filterrole->where('rolemenus.role_id', $id);
        };
        $filterrole->where('submenus.submenu_link', $key);
        $query = $filterrole->get();
---
SELECT `submenus`.`submenu_link`
FROM `rolemenus`
JOIN `roles` ON `roles`.`role_id` = `rolemenus`.`role_id`
JOIN `submenus` ON `submenus`.`submenu_id` = `rolemenus`.`submenu_id`
WHERE `submenus`.`submenu_link` = ''